import { useRoute } from "vitepress";
import { computed, onMounted, ref, watch } from "vue";

export function useRandomPeotry() {
  const peoList = [
    "人有悲欢离合，月有阴晴圆缺，此事古难全。但愿人长久，千里共婵娟。",
    "大江东去，浪淘尽，千古风流人物。",
    "十年生死两茫茫，不思量，自难忘。",
    "老夫聊发少年狂，左牵黄，右擎苍。",
    "谁道人生无再少？门前流水尚能西！休将白发唱黄鸡。",
    "雪沫乳花浮午盏，蓼茸蒿笋试春盘。人间有味是清欢。",
    "休对故人思故国，且将新火试新茶。诗酒趁年华。",
    "春宵一刻值千金，花有清香月有阴。歌管楼台声细细，秋千院落夜沉沉。",
    "试问岭南应不好，却道：此心安处是吾乡。",
    "竹杖芒鞋轻胜马，谁怕？一蓑烟雨任平生。回首向来萧瑟处，归去，也无风雨也无晴。",
    "尊前不用翠眉颦。人生如逆旅，我亦是行人。",
    "试问闲情都几许？一川烟草，满城风絮，梅子黄时雨。",
    "莫等闲，白了少年头，空悲切。",
    "人间四月芳菲尽，山寺桃花始盛开。",
    "当夏天过去后，还有鲜花未曾开放。",
    "待到山花烂漫时，她在丛中笑。",
    "人生若只如初见，何事秋风悲画扇。等闲变却故人心，却道故人心易变。",
    "人生得意须尽欢，莫使金樽空对月。天生我材必有用，千金散尽还复来。",
    "花间一壶酒，独酌无相亲。举杯邀明月，对影成三人。",
    "行路难，行路难，多歧路，今安在？长风破浪会有时，直挂云帆济沧海。",
    "给每一条河每一座山取一个温暖的名字，我有一所房子，面朝大海，春暖花开。",
    "那时我们有梦，关于文学，关于爱情，关于穿越世界的旅行。",
    "黑夜给了我黑色的眼睛，我却用它寻找光明。",
    "你，一会看我，一会看云。我觉得，你看我时很远，你看云时很近。",
    "娉娉袅袅十三余，豆蔻梢头二月初。春风十里扬州路，卷上珠帘总不如。",
    "青山隐隐水迢迢，秋尽江南草未凋。二十四桥明月夜，玉人何处教吹箫。",
    "春水初生，春林初盛，春风十里，不如你。",
    "天对地，雨对风。大陆对长空。山花对海树，赤日对苍穹。",
    "我走过许多地方的路，行过许多地方的桥，看过许多次数的云，喝过许多种类的酒，却只爱过一个正当最好年龄的人。",
    "我就这样一面看水一面想你。",
    "一个士兵要不战死沙场，便是回到故乡。",
    "我明白你会来，所以我等。",
    "一个女子在诗人的诗中，永远不会老去，但诗人他自己却老去了。",
    "一个人应当去生活，不应当尽去想象生活。",
    "你站在桥上看风景，看风景人在楼上看你。明月装饰了你的窗子，你装饰了别人的梦。",
    "我想对你做，春天在桃树上做的事。",
    "要你可爱的手中的麦穗的清香，再一次在我身上飘过，让我感到改变了我命运的温柔。",
    "我要你的耳朵继续听着风声，闻着我们一起爱过的海的芬芳，继续踩着我们踩过的沙滩。",
  ];

  let pId = ref(0);
  const curPoe = computed(() => peoList[pId.value]);
  const routeInfo = useRoute();

  function changePoe() {
    pId.value = Math.floor(Math.random() * peoList.length);
  }

  onMounted(() => changePoe());
  watch(
    () => routeInfo.path,
    () => changePoe()
  );

  return {
    curPoe,
    changePoe,
  };
}
